Tekla.Structures.AnalysisInternal.dotADResultCase_t
Serialization structure for the analysis result

Tekla.Structures.AnalysisInternal.dotADResultCase_t.aAnalysisModelName
Name of the property

Tekla.Structures.AnalysisInternal.dotADResultCase_t.LoadCaseId
Load case ID

Tekla.Structures.AnalysisInternal.dotADResultCase_t.LoadCase
Load case number

Tekla.Structures.AnalysisInternal.dotADResultCase_t.aLoadCaseName
Load case name

Tekla.Structures.AnalysisInternal.dotADResultCase_t.LoadCaseType
LoadCase type

Tekla.Structures.AnalysisInternal.dotADResultCase_t.aLoadCaseInfo
Load case info